[
    {
        "name":"Odalan",
        "descriptions":"If you visit the island on certain dates, your visit might turn out to be truly unforgettable. At given times and year around, Man turns his Island into a giant playground for the many gods that have to be worshipped here. Then the real soul of Bali is revealed and you too will be dazzled by some enchanting ceremonies and the millions of colors that come with it… Pretty high chance you will stumble into a modest village ceremony or be welcomed on one of the bigger events, staged every 210 days according the Balinese calendar, to commemorate the birth of temple, during your stay on the island. Taken into account that every village has some three temples and that all this holy places will celebrate on a different date, you understand why Bali sometimes looks to be in a permanent state of religious bliss!",
        "image_url":"https://upload.wikimedia.org/wikipedia/commons/d/da/Odalan_procession.JPG"
    },
    {
        "name":"The Rice Fields Of Bali",
        "descriptions":"Bali's rice terraces, amazingly built against the slopes of the mountains like giant staircases, remain the focal point of the natural beauty of the island. Time after time, visitors and residents are stunned by the sheer ingenuity of the landscape. Often people wonder how it is possible that simple farmers could design, build and maintain such complex systems of irrigation to flow the fields so they can produce the vital stock for the inhabitants of this blissful island. The answer, as with so many aspects of life on Bali, lies within a close-knit village organization most typical for Balinese villages and called the subak. These vital cooperation are organized along those areas fed by the same source, such as a canal or spring. In Bali, there are more than a thousand subak and some villages are member of more than one, depending on the local drainage patterns. These societies are the framework, within which generations of Balinese farmers could change the island's landscape, clearing forests, digging canals and terracing hillsides so that Bali was effectively transformed into one of the most efficient rice growers in the whole world. While these subak regulate all matters connected with plantings, water distribution, maintenance of canals and waterways, they also take care of the religious aspect involved. No small undertaking, as one should bare in mind that rivers and streams in Bali flow within deep gorges from north to south and thus the Balinese had to dig tunnels, some more than a mile long. All means were good to get the life-sustaining water to their fields! At the same time, it is the members responsibility to take care of the numerous rites, ceremonies and offerings in and around the subak's temples, which results in an endless cycle of colorful rituals and ceremonies to keep the powers of the Universe in balance...",
        "image_url":"https://upload.wikimedia.org/wikipedia/commons/8/88/Jatiluwih_rice_terraces.jpg"
    },
    {
        "name":"Ngaben",
        "descriptions":"While traveling around on Bali, you might stumble into a funeral cremation, which for the most part, is not a typical sad occasion. It is one of those all-important Balinese transition rites, carrying every child, man and women on the island from one life cycle into another one. The transformation into a next life, a prospect that all Balinese face if the rites are observed and pursued in the right manner, is perhaps the most important of them all. As one might expect, this comes with elaborate, lengthy and complex ceremonies, during which the body of the deceased has to be returned to the five elements of solid, energy, liquid, radiance and ether. The magnificent objects and the spectacular burning itself, make this ceremony one of the most picturesque manifestations of religion on the island. This is what happens when a Balinese passes away: If the family of the deceased person can afford it, elaborate preparations will be initiated. The whole family and the banjar or local community, will assist in setting up temporary shelters for shrines, preparation of offerings, the acquisition of holy water, the ritual slaughter of animals, the organization of puppet shows and sacred dances under the entrancing tones of a gamelan orchestra, the construction of a sarcophagus, built from a solid trunk and shaped according the caste of the deceased, and cremation towers… And all these splendid objects covered with paper, cloth, mirrors , tassels and tinsel, are to be used only once, when the body is transferred from the house to the cremation ground next to a village temple. This must be done in a frenzied procession, with joyful shouts and accompanied by the wild sounds of a portable gamelan set. The strongest men of the village will carry the heavy towers, shrines and sarcophagus on makeshift bamboo beds, while twirling them around on every corner. The soul of the deceased has to be confused, so that it cannot find its way back home and thus cause mischief for the family. Finally, the body, now an empty shell, is given back to the five elements in a purifying and all-consuming fire… All these ceremonies can take days. Those who cannot afford the considerable expenses, will bury their loved ones first. In a later stage, sometimes many years after death, a village will stage communal ceremonies, so that the enormous costs can be shared by many families. Those type of rites however, are equally splendid. One should not forget that no matter what or when, all Balinese should undergo them before a soul can be reborn or definitely salvaged…",
        "image_url":"https://1.bp.blogspot.com/-mh-LTcuThW4/Wh5ZoaDzSmI/AAAAAAAAAJs/a65KmysQl1YyJ3V9zzJ4gNW4rg6-7WGEwCLcBGAs/s1600/ngaben-2.jpg"
    },
    {
        "name":"Kuningan",
        "descriptions":"The ten day festive period between Galungan and Kuningan, ends with a popualar and colorful pilgrimage. For two days, people from all over Bali, will pay massive hommage to two sacred temples on a tiny island in front of the southern shores of Bali. Although a bridge connects Serangan with Bali, many people still prefer to cross from Belanjong beach by jukun, a traditional Balinese sailing vessel. You are not allowed to enter these 10th century sanctuaries on Serangan, but joining in with the women, men and children, all dressed in graceful ceremonial outfit, is an unforgettable experience. Sometimes the tide is so low, you can actually walk across. Once on Serangan, you will be absorbed by the crowd, chanting, praying and meditating. Maybe you are lucky enough to be around, when the devotees ferry in huge, towering puppets. They are constructed once every 210 days solely to perform in the barong landung dance. A big fair takes place outside the temple premises, adding festive accents to the atmosphere.",
        "image_url":"https://wisatabali2010.files.wordpress.com/2013/04/hari-raya-kuningan.jpg"
    },
    {
        "name":"Usaba Sambah",
        "descriptions":"You might visit Tenganan on any given date to dwell in its uniquely designed streets or to study the way double-ikat cloth is produced. After all, the sarongs and slendangs woven in this village, are believed to protect their owners from sickness and ill-fate. Several Bali Aga villages, spread all over East Bali, are home to some of the first inhabitants of Bali. Their true significance lies in the fact that they adhere to some peculiar traditional ways. This becomes clear if you visit the area somewhere in June or July, when you will almost certainly be able to witness a series of ceremonies that throw an entire community into religious frenzy. During the festive period of Usaba Sambah, all villagers dress up in their brightest outfit. Virgin girls and boys in magnificent costumes and colorful slashes, hair adorned with hammered gold, perform extremely formal and hypnotizing trance dances. If there are enough marriageable girls in the village, they will sit on the chairs of a giant, primitive ferris, revolved by foot power for hours on end. Or those smartly dressed young women, while looking slightly shy, will make careful mental notes on the dusty and noisy spectacle below: men engaging in a ferocious war dance, dueling each other with prickly panadanus leaf whips, encouraged by the intense, martial sounds of kare music…",
        "image_url":"https://nowjakarta.co.id/uploads/article/image/6374/Sacred-Swings-and-Ancient-Ways-at-Usaba-Sambah-Ceremony-_5_.jpg"
    }

]